app/Helpers/log_helper.php

    function save_log_error(\Throwable $e): void
    {
        try {
            LogError::create([
                'message' => $e->getMessage(),
                'file' => $e->getFile(),
                'line' => $e->getLine(),
                'user_id' => auth()->id(),
            ]);
---
insert into `log_errors` (`message`, `file`, `line`, `user_id`, `updated_at`, `created_at`) values ('Route [edit-barang-masuk] not defined.', 'D:\\PT Grace Project Plann\\web_pt_gip\\pt_grace_indo_pratama\\vendor\\laravel\\framework\\src\\Illuminate\\Routing\\UrlGenerator.php', 528, 2, '2026-04-30 10:10:45', '2026-04-30 10:10:45')