app/Http/Controllers/DashboardController.php

            'terhutang' => (int) ($salesSummary->payment_terhutang ?? 0),
        ];

        $totalProdukAktif = ProductVariant::query()
            ->whereNull('deleted_at')
            ->count();
---
select count(*) as aggregate from `product_variants` where `deleted_at` is null

                'sales.id',
                'sales.sale_date',
                'sales.customer_name',
                'sales.total_amount',
                'sales.paid_amount',
                'sales.debt_amount',
                'sales.status',
                'warehouses.name'
            )
            ->orderByDesc('sales.sale_date')
            ->orderByDesc('sales.id')
            ->limit(5)
            ->selectRaw('
                sales.id,
                sales.sale_date,
                sales.customer_name,
                sales.total_amount,
                sales.paid_amount,
                sales.debt_amount,
                sales.status,
                warehouses.name as warehouse_name,
                COALESCE(SUM(sale_items.quantity), 0) as qty
            ')
            ->get();
---
select
sales.id,
sales.sale_date,
sales.customer_name,
sales.total_amount,
sales.paid_amount,
sales.debt_amount,
sales.status,
warehouses.name as warehouse_name,
COALESCE(SUM(sale_items.quantity), 0) as qty
from `sales` left join `warehouses` on `sales`.`warehouse_id` = `warehouses`.`id` left join `sale_items` on `sale_items`.`sale_id` = `sales`.`id` and `sale_items`.`deleted_at` is null where `sales`.`deleted_at` is null and `sales`.`sale_date` between '2026-03-31 00:00:00' and '2026-04-29 23:59:59' and `sales`.`deleted_at` is null group by `sales`.`id`, `sales`.`sale_date`, `sales`.`customer_name`, `sales`.`total_amount`, `sales`.`paid_amount`, `sales`.`debt_amount`, `sales`.`status`, `warehouses`.`name` order by `sales`.`sale_date` desc, `sales`.`id` desc limit 5


        $firstItemNames = [];
        if (! empty($latestSaleIds)) {
            $firstItemNames = DB::table('sale_items')
                ->join('product_stocks', 'sale_items.product_stock_id', '=', 'product_stocks.id')
                ->join('product_variants', 'product_stocks.product_variant_id', '=', 'product_variants.id')
                ->whereIn('sale_items.sale_id', $latestSaleIds)
                ->whereNull('sale_items.deleted_at')
                ->whereNull('product_stocks.deleted_at')
                ->whereNull('product_variants.deleted_at')
                ->select(
                    'sale_items.sale_id',
                    'sale_items.id as sale_item_id',
                    'product_variants.name as variant_name'
                )
                ->orderBy('sale_items.sale_id')
                ->orderBy('sale_items.id')
                ->get()
                ->groupBy('sale_id')
                ->map(function ($items) {
                    return optional($items->first())->variant_name ?? '-';
                })
                ->toArray();
---
select `sale_items`.`sale_id`, `sale_items`.`id` as `sale_item_id`, `product_variants`.`name` as `variant_name` from `sale_items` inner join `product_stocks` on `sale_items`.`product_stock_id` = `product_stocks`.`id` inner join `product_variants` on `product_stocks`.`product_variant_id` = `product_variants`.`id` where `sale_items`.`sale_id` in (8, 28, 50, 44, 26) and `sale_items`.`deleted_at` is null and `product_stocks`.`deleted_at` is null and `product_variants`.`deleted_at` is null order by `sale_items`.`sale_id` asc, `sale_items`.`id` asc

        $topProducts = DB::table('sale_items')
            ->join('sales', 'sale_items.sale_id', '=', 'sales.id')
            ->join('product_stocks', 'sale_items.product_stock_id', '=', 'product_stocks.id')
            ->join('product_variants', 'product_stocks.product_variant_id', '=', 'product_variants.id')
            ->join('products', 'product_variants.product_id', '=', 'products.id')
            ->when($warehouseId, function ($query) use ($warehouseId) {
                $query->where('sales.warehouse_id', $warehouseId);
            })
            ->whereNull('sale_items.deleted_at')
            ->whereNull('sales.deleted_at')
            ->whereNull('product_stocks.deleted_at')
            ->whereNull('product_variants.deleted_at')
            ->whereNull('products.deleted_at')
            ->whereBetween('sales.sale_date', [$dateFrom, $dateTo])
            ->selectRaw('
                products.name as product_name,
                product_variants.name as variant_name,
                COALESCE(SUM(sale_items.quantity), 0) as total_qty,
                COALESCE(SUM(sale_items.subtotal), 0) as total_revenue
            ')
            ->groupBy('products.name', 'product_variants.name')
            ->orderByDesc('total_qty')
            ->limit(5)
            ->get();

        $stockByWarehouse = DB::table('product_stocks')
            ->join('warehouses', 'product_stocks.warehouse_id', '=', 'warehouses.id')
            ->whereNull('product_stocks.deleted_at')
            ->whereNull('warehouses.deleted_at')
            ->selectRaw('
                warehouses.id,
                warehouses.name,
                COALESCE(SUM(product_stocks.stock), 0) as total_stock
            ')
            ->groupBy('warehouses.id', 'warehouses.name')
            ->orderByDesc('total_stock')
            ->get();
---
select
products.name as product_name,
product_variants.name as variant_name,
COALESCE(SUM(sale_items.quantity), 0) as total_qty,
COALESCE(SUM(sale_items.subtotal), 0) as total_revenue
from `sale_items` inner join `sales` on `sale_items`.`sale_id` = `sales`.`id` inner join `product_stocks` on `sale_items`.`product_stock_id` = `product_stocks`.`id` inner join `product_variants` on `product_stocks`.`product_variant_id` = `product_variants`.`id` inner join `products` on `product_variants`.`product_id` = `products`.`id` where `sale_items`.`deleted_at` is null and `sales`.`deleted_at` is null and `product_stocks`.`deleted_at` is null and `product_variants`.`deleted_at` is null and `products`.`deleted_at` is null and `sales`.`sale_date` between '2026-03-31 00:00:00' and '2026-04-29 23:59:59' group by `products`.`name`, `product_variants`.`name` order by `total_qty` desc limit 5
select
warehouses.id,
warehouses.name,
COALESCE(SUM(product_stocks.stock), 0) as total_stock
from `product_stocks` inner join `warehouses` on `product_stocks`.`warehouse_id` = `warehouses`.`id` where `product_stocks`.`deleted_at` is null and `warehouses`.`deleted_at` is null group by `warehouses`.`id`, `warehouses`.`name` order by `total_stock` desc

        | Total hanya dihitung sesuai date_from dan date_to.
        |--------------------------------------------------------------------------
        */
        $trendRows = Sale::query()
            ->when($warehouseId, function ($query) use ($warehouseId) {
                $query->where('warehouse_id', $warehouseId);
            })
            ->whereNull('deleted_at')
            ->whereBetween('sale_date', [$dateFrom, $dateTo])
            ->selectRaw("DATE_FORMAT(sale_date, '%Y-%m') as period, COALESCE(SUM(total_amount), 0) as total")
            ->groupBy('period')
            ->orderBy('period')
            ->pluck('total', 'period');
---
select DATE_FORMAT(sale_date, '%Y-%m') as period, COALESCE(SUM(total_amount), 0) as total from `sales` where `deleted_at` is null and `sale_date` between '2026-03-31 00:00:00' and '2026-04-29 23:59:59' and `sales`.`deleted_at` is null group by `period` order by `period` asc


        $topWarehouses = DB::table('sale_items')
            ->join('sales', 'sale_items.sale_id', '=', 'sales.id')
            ->join('warehouses', 'sales.warehouse_id', '=', 'warehouses.id')
            ->when($warehouseId, function ($query) use ($warehouseId) {
                $query->where('sales.warehouse_id', $warehouseId);
            })
            ->whereNull('sale_items.deleted_at')
            ->whereNull('sales.deleted_at')
            ->whereNull('warehouses.deleted_at')
            ->whereBetween('sales.sale_date', [$dateFrom, $dateTo])
            ->selectRaw('
                warehouses.id,
                warehouses.name,
                warehouses.type,
                warehouses.city,
                COALESCE(SUM(sale_items.quantity), 0) as total_qty_terjual,
                COALESCE(SUM(sale_items.subtotal), 0) as total_revenue,
                COUNT(DISTINCT sales.id) as total_transaksi
            ')
            ->groupBy('warehouses.id', 'warehouses.name', 'warehouses.type', 'warehouses.city')
            ->orderByDesc('total_qty_terjual')
            ->limit(5)
            ->get();
---
select
warehouses.id,
warehouses.name,
warehouses.type,
warehouses.city,
COALESCE(SUM(sale_items.quantity), 0) as total_qty_terjual,
COALESCE(SUM(sale_items.subtotal), 0) as total_revenue,
COUNT(DISTINCT sales.id) as total_transaksi
from `sale_items` inner join `sales` on `sale_items`.`sale_id` = `sales`.`id` inner join `warehouses` on `sales`.`warehouse_id` = `warehouses`.`id` where `sale_items`.`deleted_at` is null and `sales`.`deleted_at` is null and `warehouses`.`deleted_at` is null and `sales`.`sale_date` between '2026-03-31 00:00:00' and '2026-04-29 23:59:59' group by `warehouses`.`id`, `warehouses`.`name`, `warehouses`.`type`, `warehouses`.`city` order by `total_qty_terjual` desc limit 5