app/Http/Controllers/EmployeeController.php

    public function index(Request $request)
    {
        $q = Employee::query();
        if ($request->filled('nip')) {
            $q->where('nip', 'like', '%' . $request->nip . '%');
        }
        if ($request->filled('name')) {
            $q->where('name', 'like', '%' . $request->name . '%');
        }
        if ($request->filled('email')) {
            $q->where('email', 'like', '%' . $request->email . '%');
        }
        if ($request->filled('phone')) {
            $q->where('phone', 'like', '%' . $request->phone . '%');
        }
        if ($request->filled('position')) {
            $q->where('position', 'like', '%' . $request->position . '%');
        }
        $perPage = (int) ($request->get('per_page', 10));
        $perPage = in_array($perPage, [10, 25, 50, 100, 500]) ? $perPage : 10;
        $employees = $q->orderBy('created_at', 'desc')->paginate($perPage)->withQueryString();
---
select * from `employees` where `employees`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `employees` where `employees`.`deleted_at` is null

    private function generateNip()
    {
        return DB::transaction(function () {

            $year = date('Y');

            // ambil nip terakhir di tahun ini
            $lastEmployee = Employee::where('nip', 'like', $year . '%')
                ->orderBy('nip', 'desc')
                ->lockForUpdate() // <-- penting untuk mencegah duplicate saat bersamaan
                ->first();
---
select * from `employees` where `nip` like '2026%' and `employees`.`deleted_at` is null order by `nip` desc limit 1 for update

    public function store(Request $request)
    {
        $request->validate([
            'name' => 'required|string|max:255',
            'birthday' => 'required|date',
            'email' => 'required|email|unique:employees,email',
            'position' => 'string|max:255',
            'phone' => 'required|string|max:20|unique:employees,phone',
            'country' => 'required|string',
            'province' => 'required|string',
            'city' => 'required|string',
            'postal_code' => 'nullable|string',
            'address' => 'required|string',
            'profile_image' => 'required|image|mimes:jpg,jpeg,png,webp|max:5048',
            'warehouse_id' => 'nullable|exists:warehouses,id',
        ]);
        try {
            $request->birthday = Carbon::parse($request->birthday)->setTimeZone('Asia/Jakarta')->format('Y-m-d');
            $nip = $this->generateNip();
            $employee = Employee::create([
                'nip' => $nip,
                'name' => $request->name,
                'position' => $request->position,
                'birthday' => $request->birthday,
                'email' => $request->email,
                'phone' => $request->phone,
                'country' => $request->country,
                'province' => $request->province,
                'city' => $request->city,
                'postal_code' => $request->postal_code,
                'address' => $request->address,
                'warehouse_id' => $request->warehouse_id,
                'created_at' => now('Asia/Jakarta')->format('Y-m-d H:i:s'),
            ]);
---
insert into `employees` (`nip`, `name`, `position`, `birthday`, `email`, `phone`, `country`, `province`, `city`, `postal_code`, `address`, `warehouse_id`, `updated_at`, `created_at`) values ('20260002', 'Bambang Pratama Putra Hadi', 'Kepala Pemasaran', '2000-03-18', 'bambangpratamaph@gmail.com', '089900000001', 'Indonesia', 'North Sumatra', 'Medan', '79357', 'Yyyyy', '2', '2026-04-29 15:39:39', '2026-04-29 15:39:39')