app/Http/Controllers/LogErrorController.php

select * from `log_errors` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `log_errors`
---
    public function index()
    {
        $logerrors = LogError::paginate(10);