app/Http/Controllers/PermissionController.php

    public function index(Request $request)
    {
        $q = Permission::query()->latest();

        if ($request->filled('name')) {
            $q->where('name', 'like', '%'.$request->name.'%');
        }

        if ($request->filled('guard_name')) {
            $q->where('guard_name', 'like', '%'.$request->guard_name.'%');
        }

        $perPage = (int) $request->get('per_page', 10);
        $perPage = in_array($perPage, [10, 25, 50, 100, 500]) ? $perPage : 10;

        $permissions = $q->paginate($perPage)->withQueryString();
---
select * from `permissions` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `permissions`