app/Http/Controllers/ProcurementController.php

select * from `warehouses` where `warehouses`.`id` in (1) and `warehouses`.`deleted_at` is null
select * from `procurement_items` where `procurement_items`.`procurement_id` in (1, 2) and `procurement_items`.`deleted_at` is null
---
    public function index(Request $request)
    {
        $q = Procurement::query()
            ->with(['procurement_items', 'userRequest', 'warehouse'])
            ->orderBy('created_at', 'desc');

        if ($request->filled('name')) {
            $q->whereHas('userRequest', function ($query) use ($request) {
                $query->where('name', 'like', '%'.$request->name.'%');
            });
        }

        // FILTER STATUS
        if ($request->filled('status')) {
            $q->where('status', $request->status);
        }

        if ($request->filled('warehouse_id')) {
            $q->where('warehouse_id', $request->warehouse_id);
        }

        // FILTER TANGGAL (purchase_at)
        if ($request->filled('date_from')) {
            $q->whereDate('purchase_at', '>=', $request->date_from);
        }
        if ($request->filled('date_to')) {
            $q->whereDate('purchase_at', '<=', $request->date_to);
        }

        // ROWS PER PAGE (dropdown 10/25/50)
        $perPage = (int) ($request->get('per_page', 10));

select distinct `status` from `procurements` where `status` is not null and `procurements`.`deleted_at` is null order by `status` asc
---
        $procurements = $q->paginate($perPage)->withQueryString();
        $warehouses = Warehouse::all();

        $statuses = Procurement::query()
            ->select('status')
            ->whereNotNull('status')
            ->distinct()
            ->orderBy('status')
            ->pluck('status');

select `id`, `code`, `name`, `unit` from `raw_materials` where `raw_materials`.`deleted_at` is null order by `name` asc
---
    public function create()
    {

        $warehouses = Warehouse::where('type', 'produksi')->get();
        $rawMaterials = RawMaterial::select('id', 'code', 'name', 'unit')
            ->orderBy('name')
            ->get();

select * from `procurement_items` where `procurement_items`.`procurement_id` in (3) and `procurement_items`.`deleted_at` is null
select * from `procurements` where `procurements`.`id` = '3' and `procurements`.`deleted_at` is null limit 1
select * from `raw_materials` where `raw_materials`.`id` in (8, 10) and `raw_materials`.`deleted_at` is null
---
    public function edit(Request $request, $id)
    {

        $warehouses = Warehouse::where('type', 'produksi')->get();
        $procurement = Procurement::with('procurement_items.raw_material')
            ->findOrFail($id);

select * from `procurements` where `procurements`.`id` = '5' and `procurements`.`deleted_at` is null limit 1
update `procurements` set `status` = 'Disetujui', `approved_by` = 1, `approved_at` = '2026-04-30 10:28:09', `procurements`.`updated_at` = '2026-04-30 10:28:09' where `id` = 5
---
    public function update(Request $request, $id)
    {
        $validated = $request->validate([
            'status' => 'required|string',
            'reason' => 'nullable|string',
        ]);

        try {
            $procurement = Procurement::findOrFail($id);
            if ($validated['status'] === 'Disetujui') {
                $procurement->update([
                    'status' => $validated['status'],
                    'approved_at' => now(),
                    'approved_by' => auth()->user()->id,
                ]);