app/Http/Controllers/ProcurementController.php

select * from `warehouses` where `type` = 'produksi' and `warehouses`.`deleted_at` is null
---
    public function index(Request $request)
    {
        $warehouseId = auth()->user()->employee?->warehouse_id;

        $q = Procurement::query()
            ->with(['procurement_items', 'userRequest', 'warehouse'])
            ->withCount('purchaseReceipts')
            ->orderBy('created_at', 'desc');

        // Jika user punya warehouse_id, procurement hanya gudang itu
        if ($warehouseId) {
            $q->where('warehouse_id', $warehouseId);
        }

        if ($request->filled('name')) {
            $q->whereHas('userRequest', function ($query) use ($request) {
                $query->where('name', 'like', '%' . $request->name . '%');
            });
        }

        if ($request->filled('status')) {
            $q->where('status', $request->status);
        }

        // Filter warehouse_id dari request hanya berlaku kalau user tidak punya gudang
        if (!$warehouseId && $request->filled('warehouse_id')) {
            $q->where('warehouse_id', $request->warehouse_id);
        }

        if ($request->filled('date_from')) {
            $q->whereDate('purchase_at', '>=', $request->date_from);