app/Http/Controllers/ProductionController.php

select * from `raw_materials` where `raw_materials`.`id` in (1) and `raw_materials`.`deleted_at` is null
---
    public function edit(ProductionBatch $productionBatch)
    {
        $productionBatch->load([
            'personResponsible',
            'productStock.productVariant.product',
            'materials.rawMaterial',
        ]);

        $personResponsible = $productionBatch->personResponsible;
        $productVariant = $productionBatch->productStock?->productVariant;
        $provinces = $this->getProvinceOptions();

        if (!$productVariant) {
            return redirect()
                ->route('admin.gudang-laporan-produksi')
                ->with('error', 'Produk pada batch produksi tidak ditemukan.');
        }

        $usedMaterials = $productionBatch->materials->keyBy('raw_material_id');

        $materials = RawMaterialStock::with('rawMaterial')
            ->where('province', $productionBatch->province)
            ->whereHas('rawMaterial', function ($query) {
                $query->whereNull('deleted_at');
            })
            ->orderBy('raw_material_id')
            ->get()
            ->map(function ($stock) use ($usedMaterials) {
                $used = $usedMaterials->get($stock->raw_material_id);

                return [
                    'raw_material_id' => $stock->raw_material_id,
                    'id_barang' => $stock->rawMaterial->code ?? '-',
                    'nama_barang' => $stock->rawMaterial->name ?? '-',
                    'stok_tersedia' => $stock->stock,
                    'unit' => $stock->rawMaterial->unit ?? '',
                    'quantity_use' => $used?->quantity_use,
                ];
            })
            ->values();