app/Http/Controllers/ProductionController.php

select * from `production_batches` where `production_batches`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select * from `warehouses` where `warehouses`.`id` in (1) and `warehouses`.`deleted_at` is null
select count(*) as aggregate from `production_batches` where `production_batches`.`deleted_at` is null
---
    public function index(Request $request)
    {
        $q = ProductionBatch::query()->with([
            'personResponsible',
            'productStock.productVariant.product',
            'materials.rawMaterial',
            'warehouse',
            'deletedBy',
        ])->latest();

        if ($request->filled('id')) {
            $q->where('id', 'like', '%'.$request->id.'%');
        }

        if ($request->filled('warehouse_id')) {
            $q->where('warehouse_id', $request->warehouse_id);
        }

        if ($request->filled('date_from')) {
            $q->whereDate('entry_date', '>=', $request->date_from);
        }

        if ($request->filled('date_to')) {
            $q->whereDate('entry_date', '<=', $request->date_to);
        }

        $perPage = (int) ($request->get('per_page', 10));
        $perPage = in_array($perPage, [10, 25, 50, 100, 500]) ? $perPage : 10;

        $productionBatches = $q->paginate($perPage)->withQueryString();

select * from `product_variants` where `product_variants`.`id` in (7)
select * from `products` where `products`.`id` in (4) and `products`.`deleted_at` is null
---
    public function pilihProduk()
    {
        $products = ProductVariant::with('product')
            ->orderBy('name')
            ->get();

select * from `products` where `products`.`id` in (4) and `products`.`deleted_at` is null
---
    public function create(ProductVariant $productVariant)
    {
        $productVariant->load('product');