app/Http/Controllers/ProductVariantController.php

select * from `product_variants` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `product_variants`
---
    public function index(Request $request)
    {
        $query = ProductVariant::query()->latest();

        if ($request->filled('sku')) {
            $query->where('sku', 'like', '%'.$request->sku.'%');
        }

        if ($request->filled('name')) {
            $query->where('name', 'like', '%'.$request->name.'%');
        }

        if ($request->filled('status')) {
            $query->where('status', $request->status);
        }

        $perPage = (int) $request->get('per_page', 10);
        $perPage = in_array($perPage, [10, 25, 50, 100, 500]) ? $perPage : 10;

        $variants = $query->paginate($perPage)->withQueryString();

insert into `product_variants` (`product_id`, `sku`, `name`, `pack_size`, `unit`, `price`, `status`, `updated_at`, `created_at`) values ('6', 'BHX-100', 'BHOS Ekstra 100 Kg', '100', 'Kg', '400000', 'aktif', '2026-04-29 16:11:21', '2026-04-29 16:11:21')
---
    public function store(Request $request)
    {
        $validated = $request->validate([
            'product_id' => ['required', 'exists:products,id'],
            'sku' => ['required', 'string', 'max:255', 'unique:product_variants,sku'],
            'name' => ['required', 'string', 'max:255'],
            'pack_size' => ['required', 'integer', 'min:0'],
            'unit' => ['required', 'string', 'max:255'],
            'price' => ['required', 'integer', 'min:0'],
            'status' => ['required', 'in:aktif,nonaktif'],
            'image' => ['required', 'image', 'mimes:jpg,jpeg,png,webp', 'max:2048'],
        ]);

        $variant = ProductVariant::create([
            'product_id' => $validated['product_id'],
            'sku' => $validated['sku'],
            'name' => $validated['name'],
            'pack_size' => $validated['pack_size'],
            'unit' => $validated['unit'],
            'price' => $validated['price'],
            'status' => $validated['status'],
        ]);