app/Http/Controllers/ProductController.php

select * from `products` where `products`.`id` = '6' and `products`.`deleted_at` is null limit 1
---
    public function updateExecutive(Request $request, $id)
    {
        $product = Product::findOrFail($id);

select * from `products` where `products`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `products` where `products`.`deleted_at` is null
---
    public function indexExecutive(Request $request)
    {
        $query = Product::query()->latest();

        if ($request->filled('code')) {
            $query->where('code', 'like', '%'.$request->code.'%');
        }

        if ($request->filled('name')) {
            $query->where('name', 'like', '%'.$request->name.'%');
        }

        if ($request->filled('status')) {
            $query->where('status', $request->status);
        }

        $perPage = (int) $request->get('per_page', 10);
        $perPage = in_array($perPage, [10, 25, 50, 100, 500]) ? $perPage : 10;

        $products = $query->paginate($perPage)->withQueryString();

select * from `warehouses` where `warehouses`.`deleted_at` is null
select * from `product_stocks` where `product_stocks`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select * from `product_variants` where `product_variants`.`id` in (1, 2, 3, 4, 5, 10)
select count(*) as aggregate from `product_stocks` where `product_stocks`.`deleted_at` is null
---
    public function productStock(Request $request)
    {
        $query = ProductStock::query()
            ->with('productVariant')
            ->latest();

        if ($request->filled('sku')) {
            $query->whereHas('productVariant', function ($q) use ($request) {
                $q->where('sku', 'like', '%'.$request->sku.'%');
            });
        }

        if ($request->filled('name_product')) {
            $query->whereHas('productVariant', function ($q) use ($request) {
                $q->where('name', 'like', '%'.$request->name_product.'%');
            });
        }
        if ($request->filled('warehouse_id')) {
            $query->where('warehouse_id', $request->warehouse_id);
        }
        $warehouses = Warehouse::all();

        $perPage = (int) $request->get('per_page', 10);
        $perPage = in_array($perPage, [10, 25, 50, 100, 500]) ? $perPage : 10;

        $productStocks = $query->paginate($perPage)->withQueryString();