app/Http/Controllers/ProductionController.php

    public function index(Request $request)
    {
        $q = ProductionBatch::query()
            ->with(['personResponsible', 'productStock.productVariant.product', 'materials.rawMaterial', 'warehouse', 'deletedBy'])
            ->latest();
        $warehouseId = auth()->user()->employee?->warehouse_id;
        // Jika user punya warehouse_id, procurement hanya gudang itu
        if ($warehouseId) {
            $q->where('warehouse_id', $warehouseId);
        }
        // Filter warehouse_id dari request hanya berlaku kalau user tidak punya gudang
        if (!$warehouseId && $request->filled('warehouse_id')) {
            $q->where('warehouse_id', $request->warehouse_id);
        }
        if ($request->filled('id')) {
            $q->where('id', 'like', '%' . $request->id . '%');
        }

        if ($request->filled('date_from')) {
            $q->whereDate('entry_date', '>=', $request->date_from);
---
select * from `warehouses` where `type` = 'produksi' and `warehouses`.`deleted_at` is null