app/Http/Controllers/PurchaseReceiptController.php

    public function store(Request $request)
    {
        $validated = $request->validate([
            'procurement_id' => ['required', 'integer', 'exists:procurements,id'],
            'received_at' => ['required', 'date'],
            'total_price' => ['nullable', 'integer', 'min:0'],
            'items' => ['required', 'array', 'min:1'],
            'items.*.raw_material_id' => ['required', 'integer', 'exists:raw_materials,id'],
            'items.*.quantity_received' => ['required', 'integer', 'min:1'],
            'invoices' => ['required', 'array'],
            'invoices.*' => ['file', 'mimes:jpg,jpeg,png,pdf', 'max:3072'], // 3MB
        ]);
        $rawIds = collect($validated['items'])->pluck('raw_material_id')->unique()->values();
        $count = RawMaterial::whereIn('id', $rawIds)->count();
        if ($count !== $rawIds->count()) {
            return back()->withInput()->withErrors([
                'items' => 'Ada item raw material yang tidak valid.',
            ]);
        }
        try {
            $receipt = DB::transaction(function () use ($request, $validated) {
                $userId = auth()->id();

                // Receipt number (silakan sesuaikan format)
                $receiptNumber = 'RCPT-'.now()->format('Ymd').'-'.strtoupper(Str::random(6));
                $procurement = Procurement::findOrFail($validated['procurement_id']);
                $warehouse_id = $procurement->warehouse_id;
                $receipt = PurchaseReceipt::create([
                    'receipt_number' => $receiptNumber,
                    'warehouse_id' => $warehouse_id,
                    'procurement_id' => (int) $validated['procurement_id'],
                    'received_at' => $validated['received_at'],
                    'received_by' => $userId,
                    'status' => 'received',
                    'note' => null,
                    'total_price' => (int) ($validated['total_price'] ?? 0),
                ]);

                // Simpan items
                foreach ($validated['items'] as $row) {
                    PurchaseReceiptItem::create([
---
select * from `purchase_receipts` where `purchase_receipts`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `purchase_receipts` where `purchase_receipts`.`deleted_at` is null
select * from `warehouses` where `warehouses`.`deleted_at` is null
select * from `procurements` where `status` = 'disetujui' and `procurements`.`deleted_at` is null

    public function update(Request $request, $id)
    {
        $validated = $request->validate([
            'received_at' => ['required', 'date'],
            'total_price' => ['nullable', 'integer', 'min:0'],

            'items' => ['required', 'array', 'min:1'],
            'items.*.raw_material_id' => ['required', 'integer', 'exists:raw_materials,id'],
            'items.*.quantity_received' => ['required', 'integer', 'min:1'],
        ]);

        try {
            DB::transaction(function () use ($validated, $id) {
                $userId = auth()->id();
                $receipt = PurchaseReceipt::with(['items'])->findOrFail($id);
                foreach ($receipt->items as $oldItem) {
                    RawMaterialStock::where([
                        'raw_material_id' => (int) $oldItem->raw_material_id,
                        'warehouse_id' => $receipt->warehouse_id,
                    ])->decrement('stock', (int) $oldItem->quantity_received);
                }

                RawMaterialStockMovement::where([
                    'ref_type' => PurchaseReceipt::class,
                    'ref_id' => $receipt->id,
                ])->delete();

                $procurement = Procurement::findOrFail($receipt->procurement_id);
                $warehouse_id = $procurement->warehouse_id;
                $receipt->update([
                    'warehouse_id' => $warehouse_id,
                    'received_at' => $validated['received_at'],
                    'total_price' => (int) ($validated['total_price'] ?? 0),
                ]);

                PurchaseReceiptItem::where('purchase_receipt_id', $receipt->id)->delete();
---
select * from `warehouses` where `warehouses`.`deleted_at` is null
select * from `purchase_receipts` where `purchase_receipts`.`id` = '2' and `purchase_receipts`.`deleted_at` is null limit 1
select * from `raw_materials` where `raw_materials`.`id` in (8, 11) and `raw_materials`.`deleted_at` is null
select * from `purchase_receipt_items` where `purchase_receipt_items`.`purchase_receipt_id` in (1) and `purchase_receipt_items`.`deleted_at` is null

                    ]);

                    // pastikan stock row ada
                    RawMaterialStock::updateOrCreate(
                        [
                            'raw_material_id' => (int) $row['raw_material_id'],
                            'warehouse_id' => $receipt->warehouse_id,
                        ],
                        []
                    );
---
update `raw_material_stocks` set `stock` = `stock` - 100, `raw_material_stocks`.`updated_at` = '2026-04-30 10:10:45' where (`raw_material_id` = 11 and `warehouse_id` = 1) and `raw_material_stocks`.`deleted_at` is null

    public function destroy($id)
    {
        try {
            DB::transaction(function () use ($id) {
                $receipt = PurchaseReceipt::with(['items'])->findOrFail($id);

                // CEK: jangan sampai stok jadi minus setelah reverse
                foreach ($receipt->items as $item) {
                    $current = RawMaterialStock::where([
                        'raw_material_id' => (int) $item->raw_material_id,
                        'warehouse_id' => $receipt->warehouse_id,
                    ])->value('stock') ?? 0;

                    if ($current < (int) $item->quantity_received) {
                        throw new \Exception('Stok sudah terpakai. Tidak bisa hapus barang masuk ini.');
                    }
                }

                // REVERSE STOK
                foreach ($receipt->items as $item) {
                    RawMaterialStock::where([
                        'raw_material_id' => (int) $item->raw_material_id,
                        'warehouse_id' => $receipt->warehouse_id,
                    ])->decrement('stock', (int) $item->quantity_received);
---
select * from `raw_material_stocks` where (`raw_material_id` = 11 and `warehouse_id` = 1) and `raw_material_stocks`.`deleted_at` is null limit 1
update `raw_material_stocks` set `stock` = `stock` + 100, `raw_material_stocks`.`updated_at` = '2026-04-30 10:10:45' where (`raw_material_id` = 11 and `warehouse_id` = 1) and `raw_material_stocks`.`deleted_at` is null