app/Http/Controllers/PurchaseReceiptController.php

select * from `procurement_items` where `procurement_items`.`procurement_id` in (1) and `procurement_items`.`deleted_at` is null
select * from `raw_materials` where `raw_materials`.`id` in (11) and `raw_materials`.`deleted_at` is null
---
    public function getProcurementItems(Procurement $procurement)
    {
        try {
            $procurement->load([
                'procurement_items.raw_material',
            ]);

select * from `purchase_receipts` where `purchase_receipts`.`id` = '2' and `purchase_receipts`.`deleted_at` is null limit 1
---
    public function addMedia(Request $request, $id)
    {
        $request->validate([
            'invoices' => ['required'],
            'invoices.*' => ['file', 'mimes:jpg,jpeg,png,pdf', 'max:3072'],
        ]);
        try {
            $receipt = PurchaseReceipt::findOrFail($id);