app/Http/Controllers/PurchaseReceiptController.php

select `id`, `code`, `name`, `unit` from `raw_materials` where `raw_materials`.`deleted_at` is null order by `name` asc
select * from `procurements` where (`status` = 'diterima' or `id` = 1) and `procurements`.`deleted_at` is null
---
    public function create()
    {
        $user = auth()->user();
        $userWarehouseId = optional($user->employee)->warehouse_id;

        $hasFullCreate = $user->can('tambah bahan baku masuk');
        $hasOwnWarehouseCreate = $user->can('tambah bahan baku masuk gudang sendiri');

        if (!$hasFullCreate && !$hasOwnWarehouseCreate) {
            abort(403, 'Anda tidak memiliki akses untuk menambah bahan baku masuk.');
        }

        $isOwnWarehouseOnly = !$hasFullCreate && $hasOwnWarehouseCreate;

        $warehouses = Warehouse::when($isOwnWarehouseOnly && $userWarehouseId, function ($query) use ($userWarehouseId) {
            $query->where('id', $userWarehouseId);
        })->get();

        $rawMaterials = RawMaterial::select('id', 'code', 'name', 'unit')
            ->orderBy('name')
            ->get();

        $procurements = Procurement::where('status', 'disetujui')
            ->when($isOwnWarehouseOnly && $userWarehouseId, function ($query) use ($userWarehouseId) {
                $query->where('warehouse_id', $userWarehouseId);
            })
            ->get();

select * from `procurements` where `procurements`.`id` = 3 and `procurements`.`deleted_at` is null limit 1
insert into `purchase_receipt_items` (`purchase_receipt_id`, `raw_material_id`, `quantity_received`, `updated_at`, `created_at`) values (2, 11, 100, '2026-04-30 10:10:45', '2026-04-30 10:10:45')
insert into `raw_material_stock_movements` (`warehouse_id`, `raw_material_id`, `type`, `stock`, `ref_type`, `ref_id`, `responsible_id`, `note`, `updated_at`, `created_at`) values (1, 11, 'in', 100, 'App\\Models\\PurchaseReceipt', 2, 2, 'Update penerimaan dari procurement ID 3', '2026-04-30 10:10:45', '2026-04-30 10:10:45')
---
            ]);
        }
        try {
            $receipt = DB::transaction(function () use ($request, $validated) {
                $userId = auth()->id();

                // Receipt number
                $receiptNumber = 'RCPT-'.now()->format('Ymd').'-'.strtoupper(Str::random(6));
                $procurement = Procurement::findOrFail($validated['procurement_id']);
                $warehouse_id = $procurement->warehouse_id;
                $receipt = PurchaseReceipt::create([
                    'receipt_number' => $receiptNumber,
                    'warehouse_id' => $warehouse_id,
                    'procurement_id' => (int) $validated['procurement_id'],
                    'received_at' => $validated['received_at'],
                    'received_by' => $userId,
                    'status' => 'received',
                    'note' => null,
                    'total_price' => (int) ($validated['total_price'] ?? 0),
                ]);

                // Simpan items
                foreach ($validated['items'] as $row) {
                    PurchaseReceiptItem::create([
                        'purchase_receipt_id' => $receipt->id,
                        'raw_material_id' => (int) $row['raw_material_id'],
                        'quantity_received' => (int) $row['quantity_received'],
                    ]);
                    RawMaterialStockMovement::create([
                        'warehouse_id' => $warehouse_id,
                        'raw_material_id' => (int) $row['raw_material_id'],
                        'type' => 'in',
                        'stock' => (int) $row['quantity_received'],
                        'ref_type' => PurchaseReceipt::class,
                        'ref_id' => $receipt->id,
                        'responsible_id' => $userId,
                        'note' => "Penerimaan dari procurement ID {$receipt->procurement_id}",
                    ]);