app/Http/Controllers/RawMaterialController.php

select * from `warehouses` where `warehouses`.`deleted_at` is null
---
    public function exportStock(Request $request)
    {
        $warehouseId = auth()->user()->employee?->warehouse_id;
        $q = RawMaterialStock::query()->with(['rawMaterial', 'warehouse']);

        if ($warehouseId) {
            $q->where('warehouse_id', $warehouseId);
        } elseif ($request->filled('warehouse_id')) {
            $q->where('warehouse_id', $request->warehouse_id);
        }

        if ($request->filled('code')) {
            $q->whereHas('rawMaterial', function ($u) use ($request) {
                $u->where('code', 'like', "%{$request->code}%");
            });