app/Http/Controllers/RawMaterialController.php

    public function stockIndex(Request $request)
    {
        $q = RawMaterialStock::query()->with('rawMaterial');
        if ($request->filled('code')) {
            $q->whereHas('rawMaterial', function ($u) use ($request) {
                $u->where('code', 'like', "%{$request->code}%");
            });
        }
        if ($request->filled('name')) {
            $search = $request->name;
            $q->whereHas('rawMaterial', function ($u) use ($search) {
                $u->where('name', 'like', "%{$search}%");
            });
        }
        if ($request->filled('province')) {
            $q->where('province', 'like', "%{$request->province}%");
        }
        $perPage = (int) ($request->get('per_page', 10));
        $perPage = in_array($perPage, [10, 25, 50, 100, 500]) ? $perPage : 10;
        $stocks = $q->paginate(5)->withQueryString();
---
select * from `raw_material_stocks` where `raw_material_stocks`.`deleted_at` is null limit 5 offset 10
select * from `raw_materials` where `raw_materials`.`id` in (6, 7, 8) and `raw_materials`.`deleted_at` is null
select count(*) as aggregate from `raw_material_stocks` where `raw_material_stocks`.`deleted_at` is null