app/Http/Controllers/RoleController.php

select * from `roles` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `roles`
---
    public function index(Request $request)
    {
        $q = Role::query()->latest();

        if ($request->filled('name')) {
            $q->where('name', 'like', '%'.$request->name.'%');
        }

        if ($request->filled('guard_name')) {
            $q->where('guard_name', 'like', '%'.$request->guard_name.'%');
        }

        $perPage = (int) $request->get('per_page', 10);
        $perPage = in_array($perPage, [10, 25, 50, 100, 500]) ? $perPage : 10;

        $roles = $q->paginate($perPage)->withQueryString();

select * from `roles` where `roles`.`id` = '2' limit 1
select * from `permissions`
---
    public function edit($id)
    {
        $role = Role::findOrFail($id);
        $permissions = Permission::all();

select * from `roles` where `roles`.`id` = '1' limit 1
---
    public function update(Request $request, $id)
    {
        $request->validate([
            'name' => 'required', Rule::unique('roles', 'name')->ignore($id),
            'permissions' => 'array',
            'permissions.*' => 'exists:permissions,name',
        ]);
        try {
            $role = Role::findOrFail($id);