app/Http/Controllers/SaleController.php


        $sales = $q->orderBy('sale_date', 'asc')->paginate($perPage)->withQueryString();

        $statuses = Sale::query()
            ->select('status')
            ->whereNotNull('status')
            ->distinct()
            ->orderBy('status')
            ->pluck('status');
---
select distinct `status` from `sales` where `status` is not null and `sales`.`deleted_at` is null order by `status` asc

    public function update(Request $request, $id)
    {
        $sale = Sale::findOrFail($id);
---
select * from `sales` where `sales`.`id` = '51' and `sales`.`deleted_at` is null limit 1

            ]);

            // Simpan history cicilan
            $paymentHistory = HistorySalePayment::create([
                'sale_id' => $sale->id,
                'created_by' => Auth::id(),
                'payment_date' => now()->toDateString(),
                'amount' => $additionalPayment,
            ]);
---
insert into `history_sale_payments` (`sale_id`, `created_by`, `payment_date`, `amount`, `updated_at`, `created_at`) values (51, 1, '2026-04-29 00:00:00', 500000, '2026-04-29 16:08:41', '2026-04-29 16:08:41')

    public function uploadDeliveryProof(Request $request, $id)
    {
        $sale = Sale::findOrFail($id);
---
select * from `sales` where `sales`.`id` = '51' and `sales`.`deleted_at` is null limit 1