app/Http/Controllers/ShipmentController.php

                        $shipment->shipmentItems()->delete();
                    }

                    $shipment->load([
                        'shipmentItems.productStock.productVariant',
                        'shipmentItems.productStock.warehouse',
                    ]);
---
select * from `warehouses` where `warehouses`.`id` in (2) and `warehouses`.`deleted_at` is null