app/Http/Controllers/ShipmentController.php

    public function index(Request $request)
    {
        $userWarehouseId = auth()->user()->employee?->warehouse_id;
        if ($userWarehouseId !== null) {
            $q = Shipment::query()
                ->with([
                    'personResponsible',
                    'warehouse',
                    'shipmentItems.productStock.warehouse',
                    'shipmentItems.productStock.productVariant.product',
                ])
                ->where(function ($query) use ($userWarehouseId) {
                    $query->where('warehouse_id', $userWarehouseId)
                        ->orWhereHas('shipmentItems.productStock', function ($q) use ($userWarehouseId) {
                            $q->where('warehouse_id', $userWarehouseId);
                        });
                });
        } else {
            $q = Shipment::query()->with(['personResponsible', 'shipmentItems.productStock.warehouse']);
        }

        if ($request->filled('name')) {
            $q->whereHas('personResponsible', function ($query) use ($request) {
                $query->where('name', 'like', '%' . $request->name . '%');
            });
        }
        if ($request->filled('code')) {
            $q->where('shipment_code', 'like', '%' . $request->code . '%');
        }
        // ROWS PER PAGE (dropdown 10/25/50)
        $perPage = (int) ($request->get('per_page', 10));
        $perPage = in_array($perPage, [10, 25, 50, 100, 500]) ? $perPage : 10;
        $warehouses = Warehouse::all();
        $shipments = $q->latest()->paginate($perPage)->withQueryString();
        $statuses = Shipment::query()
            ->select('status')
            ->whereNotNull('status')
            ->distinct()
            ->orderBy('status')
            ->pluck('status');
---
select * from `warehouses` where `warehouses`.`deleted_at` is null
select * from `warehouses` where `warehouses`.`id` in (2) and `warehouses`.`deleted_at` is null
select * from `product_stocks` where `product_stocks`.`id` in (13) and `product_stocks`.`deleted_at` is null
select * from `products` where `products`.`id` in (4) and `products`.`deleted_at` is null
select * from `shipment_items` where `shipment_items`.`shipment_id` in (1) and `shipment_items`.`deleted_at` is null
select distinct `status` from `shipments` where `status` is not null and `shipments`.`deleted_at` is null order by `status` asc

    public function edit($id)
    {
        $shipment = Shipment::with([
            'personResponsible',
            'receivedBy',
            'warehouse',
            'shipmentItems.productStock.productVariant',
            'shipmentItems.productStock.warehouse',
        ])->findOrFail($id);
---
select * from `product_stocks` where `product_stocks`.`id` in (13) and `product_stocks`.`deleted_at` is null
select * from `product_variants` where `product_variants`.`id` in (7)
select * from `shipment_items` where `shipment_items`.`shipment_id` in (1) and `shipment_items`.`deleted_at` is null
select * from `shipments` where `shipments`.`id` = '1' and `shipments`.`deleted_at` is null limit 1

    public function update(Request $request, $id)
    {
        try {
            $shipment = Shipment::with([
                'shipmentItems.productStock.productVariant',
                'shipmentItems.productStock.warehouse',
                'warehouse',
            ])->findOrFail($id);
---
select * from `product_stocks` where `product_stocks`.`id` in (13) and `product_stocks`.`deleted_at` is null
select * from `product_variants` where `product_variants`.`id` in (7)
select * from `shipment_items` where `shipment_items`.`shipment_id` in (1) and `shipment_items`.`deleted_at` is null
select * from `shipments` where `shipments`.`id` = '1' and `shipments`.`deleted_at` is null limit 1

                        ->values()
                        ->all();

                    $productStocks = ProductStock::with(['productVariant', 'warehouse'])
                        ->whereIn('id', $productStockIds)
                        ->lockForUpdate()
                        ->get()
                        ->keyBy('id');
---
select * from `product_stocks` where `id` in (14) and `product_stocks`.`deleted_at` is null for update
select * from `product_variants` where `product_variants`.`id` in (7)

                        }
                    }

                    $existingItems = $shipment->shipmentItems()->get()->keyBy('id');
---
select * from `shipment_items` where `shipment_items`.`shipment_id` = 1 and `shipment_items`.`shipment_id` is not null and `shipment_items`.`deleted_at` is null

                    }

                    if (!empty($submittedItemIds)) {
                        $shipment->shipmentItems()
                            ->whereNotIn('id', $submittedItemIds)
                            ->delete();
---
update `shipment_items` set `deleted_at` = '2026-04-29 16:00:02', `shipment_items`.`updated_at` = '2026-04-29 16:00:02' where `shipment_items`.`shipment_id` = 1 and `shipment_items`.`shipment_id` is not null and `id` not in (1) and `shipment_items`.`deleted_at` is null

                        $shipment->shipmentItems()->delete();
                    }

                    $shipment->load([
                        'shipmentItems.productStock.productVariant',
                        'shipmentItems.productStock.warehouse',
                    ]);
---
select * from `product_stocks` where `product_stocks`.`id` in (14) and `product_stocks`.`deleted_at` is null
select * from `product_variants` where `product_variants`.`id` in (7)
select * from `shipment_items` where `shipment_items`.`shipment_id` in (1) and `shipment_items`.`deleted_at` is null
select * from `warehouses` where `warehouses`.`id` in (2) and `warehouses`.`deleted_at` is null

    public function getShipmentItems($id)
    {
        $shipment = Shipment::with([
            'shipmentItems.productStock.productVariant',
        ])->findOrFail($id);
---
select * from `product_stocks` where `product_stocks`.`id` in (13) and `product_stocks`.`deleted_at` is null
select * from `product_variants` where `product_variants`.`id` in (7)
select * from `shipment_items` where `shipment_items`.`shipment_id` in (1) and `shipment_items`.`deleted_at` is null
select * from `shipments` where `shipments`.`id` = '1' and `shipments`.`deleted_at` is null limit 1