app/Http/Controllers/ShipmentReceiptController.php

select * from `shipments` where `shipments`.`id` in (1) and `shipments`.`deleted_at` is null
select * from `warehouses` where `warehouses`.`id` in (2) and `warehouses`.`deleted_at` is null
---
    public function index(Request $request)
    {
        $q = ShipmentReceipt::query()->with([
            'shipment.warehouse',
            'receivedBy',
        ]);

        if ($request->filled('name')) {
            $q->whereHas('receivedBy', function ($query) use ($request) {
                $query->where('name', 'like', '%' . $request->name . '%');
            });
        }

        if ($request->filled('code')) {
            $q->whereHas('shipment', function ($query) use ($request) {
                $query->where('shipment_code', 'like', '%' . $request->code . '%');
            });
        }

        if ($request->filled('status')) {
            $q->where('status', $request->status);
        }

        if ($request->filled('warehouse_id')) {
            $q->whereHas('shipment', function ($query) use ($request) {
                $query->where('warehouse_id', $request->warehouse_id);
            });

select distinct `status` from `shipment_receipts` where `status` is not null and `shipment_receipts`.`deleted_at` is null order by `status` asc
---

        $shipmentReceipts = $q->latest()->paginate($perPage)->withQueryString();

        $statuses = ShipmentReceipt::query()
            ->select('status')
            ->whereNotNull('status')
            ->distinct()
            ->orderBy('status')
            ->pluck('status');

select * from `warehouses` where `warehouses`.`deleted_at` is null
---
    public function print($id)
    {
        $shipmentReceipt = ShipmentReceipt::with([
            'shipment.warehouse',
            'receivedBy',
            'items.shipmentItem.productStock.productVariant',
            'media' // Tambahkan ini untuk memanggil file gambar
        ])->findOrFail($id);

select * from `shipments` where `shipments`.`id` in (1) and `shipments`.`deleted_at` is null
---
            DB::rollBack();
            save_log_error($th);

            return redirect()
                ->back()
                ->withInput()
                ->with('error', 'Shipment receipt gagal disimpan. ');

select * from `product_stocks` where `product_stocks`.`id` in (13) and `product_stocks`.`deleted_at` is null
select * from `product_variants` where `product_variants`.`id` in (7)
select * from `shipment_items` where `shipment_items`.`shipment_id` in (1) and `shipment_items`.`deleted_at` is null
select * from `shipment_receipts` where `shipment_receipts`.`id` = '1' and `shipment_receipts`.`deleted_at` is null limit 1
---
    public function edit($id)
    {
        $shipmentReceipt = ShipmentReceipt::with([
            'shipment.warehouse',
            'shipment.receivedBy',
            'items.shipmentItem.productStock.productVariant',
        ])->findOrFail($id);

update `shipments` set `status` = 'Selesai', `shipments`.`updated_at` = '2026-04-29 16:06:15' where `id` = 1
---
                $shipmentReceipt->rejected_at = null;
                $shipmentReceipt->reject_reason = null;
                $shipmentReceipt->shipment->status = 'Selesai';
                $shipmentReceipt->shipment->save();

select * from `product_stocks` where (`product_variant_id` = 7 and `warehouse_id` = 2) limit 1
update `product_stocks` set `stock` = 134, `product_stocks`.`updated_at` = '2026-04-29 16:06:15' where `id` = 14
---
                            continue;
                        }

                        $destinationProductStock = ProductStock::withTrashed()->firstOrNew([
                            'product_variant_id' => $productVariantId,
                            'warehouse_id' => $destinationWarehouseId,
                        ]);

                        if ($destinationProductStock->exists && $destinationProductStock->trashed()) {
                            $destinationProductStock->restore();

insert into `product_stock_movements` (`warehouse_id`, `product_stock_id`, `type`, `quantity`, `ref_type`, `ref_id`, `note`, `updated_at`, `created_at`) values (2, 14, 'in', 98, 'shipment_receipt', 1, 'Stock masuk dari approval shipment receipt #1', '2026-04-29 16:06:15', '2026-04-29 16:06:15')
---
                        $destinationProductStock->stock = (int) $destinationProductStock->stock + $qtyIn;
                        $destinationProductStock->save();

                        ProductStockMovement::create([
                            'warehouse_id' => $destinationWarehouseId,
                            'product_stock_id' => $destinationProductStock->id,
                            'type' => 'in',
                            'quantity' => $qtyIn,
                            'ref_type' => 'shipment_receipt',
                            'ref_id' => $shipmentReceipt->id,
                            'note' => 'Stock masuk dari approval shipment receipt #' . $shipmentReceipt->id,
                        ]);

update `shipment_receipts` set `status` = 'disetujui', `approved_by_id` = 2, `approved_at` = '2026-04-29 16:06:15', `shipment_receipts`.`updated_at` = '2026-04-29 16:06:15' where `id` = 1
---
                $shipmentReceipt->reject_reason = null;
            }

            $shipmentReceipt->save();

select * from `shipments` where `shipments`.`id` in (1) and `shipments`.`deleted_at` is null
---
            DB::rollBack();
            save_log_error($th);

            return redirect()
                ->back()
                ->withInput()
                ->with('error', 'Shipment receipt gagal diperbarui');

select * from `shipment_receipts` where `shipment_receipts`.`id` = '1' and `shipment_receipts`.`deleted_at` is null limit 1
---
    public function destroy($id)
    {
        $shipmentReceipt = ShipmentReceipt::with([
            'shipment',
            'items',
        ])->findOrFail($id);