app/Http/Controllers/UserController.php

    public function create()
    {
        $employees = Employee::all();
        $roles = Role::with('permissions')->get();
        $permissions = Permission::all();
---
select * from `employees` where `employees`.`deleted_at` is null
select * from `roles`
select `permissions`.*, `role_has_permissions`.`role_id` as `pivot_role_id`, `role_has_permissions`.`permission_id` as `pivot_permission_id` from `permissions` inner join `role_has_permissions` on `permissions`.`id` = `role_has_permissions`.`permission_id` where `role_has_permissions`.`role_id` in (1, 2, 3)
select * from `permissions`

    public function store(Request $request)
    {
        $request->validate([
            'name' => 'required|string|max:255',
            'email' => 'required|email|unique:users,email',
            'employee_id' => 'nullable|exists:employees,id',
            'password' => 'required|string|min:6|confirmed',

            'role' => 'nullable|exists:roles,name',
            'permissions' => 'array',
            'permissions.*' => 'exists:permissions,name',
        ]);
        try {
            $user = User::create([
                'name' => $request->name,
                'email' => $request->email,
                'employee_id' => $request->employee_id,
                'password' => bcrypt($request->password),
            ]);
---
insert into `users` (`name`, `email`, `employee_id`, `password`, `updated_at`, `created_at`) values ('Dian Kusuma Hadi', 'diankusumahadi@gmail.com', '1', '$2y$12$QySWdP1B8XXSChzif51gP.HWrTx7GAVYadWfTMkno5HlYkZRRvaW.', '2026-04-29 15:40:18', '2026-04-29 15:40:18')